tap "bramstein/webfonttools"
tap "homebrew/cask-versions"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "sass/sass"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
# Search tool like grep, but optimized for programmers
brew "ack"
# SSL/TLS cryptography library
brew "openssl"
# Graphical system information display for macOS
brew "archey"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Collection of portable C++ source libraries
brew "boost"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Command-line tool for Amazon Route 53
brew "cli53"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# OpenType text shaping engine
brew "harfbuzz"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Compression/decompression library aiming for high speed
brew "snappy"
# Open video compression format
brew "theora"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Scalable distributed version control system
brew "mercurial"
# Terminal-based visual file manager
brew "midnight-commander"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# General-purpose scripting language
brew "php@7.1", restart_service: true, link: true
# Object-relational database system
brew "postgresql", restart_service: true
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Convert TeXinfo files to HTML
brew "texi2html"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
brew "yarn"
# Modular BSD reimplementation of NASM
brew "yasm"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# WOFF utilities with Zopfli compression
brew "bramstein/webfonttools/sfnt2woff-zopfli"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Shell commands for environment parity for Heroku apps
brew "thoughtbot/formulae/parity"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "anki"
cask "calibre"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "firefox"
cask "flycut"
cask "folx"
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "kindle"
cask "lastpass"
cask "ngrok"
cask "nordvpn"
cask "plex-media-player"
cask "pocket-casts"
cask "postman"
cask "slack"
cask "tableplus"
cask "the-unarchiver"
cask "tor-browser"
cask "vlc"
cask "vscodium"
cask "xamarin-profiler"
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
