tap "caskroom/cask"
tap "caskroom/versions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
brew "ack"
brew "aws-elasticbeanstalk"
brew "gdbm"
brew "python"
brew "awscli"
brew "boost"
brew "gettext"
brew "cli53"
brew "cmake"
brew "coreutils"
brew "rtmpdump"
brew "dnsmasq", restart_service: true
brew "graphite2"
brew "sdl2"
brew "snappy"
brew "theora"
brew "x265"
brew "ffmpeg"
brew "libtool"
brew "gawk"
brew "git"
brew "git-flow"
brew "gobject-introspection"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "libidn2"
brew "llvm"
brew "python@2"
brew "mercurial"
brew "neovim"
brew "nginx", restart_service: true
brew "node"
brew "p7zip"
brew "php", restart_service: true, link: false
brew "php@7.1", restart_service: true, link: true
brew "postgresql", restart_service: true
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "sdl"
brew "texi2html"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "yasm"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "alfred"
cask "ampps"
cask "cyberduck"
cask "disk-inventory-x"
cask "docker"
cask "evernote"
cask "firefox"
cask "flycut"
cask "font-fira-code"
cask "github"
cask "gitkraken"
cask "gitscout"
cask "gitup"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "lastpass"
cask "lunar"
cask "mjml"
cask "ngrok"
cask "nightowl"
cask "noisy"
cask "nordvpn"
cask "omnigraffle"
cask "plex-media-player"
cask "postman"
cask "reeddit"
cask "sequel-pro"
cask "slack"
cask "tableplus"
cask "the-unarchiver"
cask "tweeten"
cask "vagrant"
cask "virtualbox"
cask "vscodium"
cask "xamarin-profiler"
